# Scalable batch and stream data processing
brew "apache-flink"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Colorize your kubectl output
brew "kubecolor"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# CLI for Mermaid diagrams (mmdc); nvim renders markdown mermaid blocks with it
brew "mermaid-cli"
# Java-based project management
brew "maven"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@16", link: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal-based AI coding assistant
cask "claude-code"
# Docker Desktop (engine + GUI); provides the docker CLI that docker-compose needs
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# JDK from the Eclipse Foundation (Adoptium) — latest LTS; required by jdtls (Java LSP, needs 17+)
cask "temurin"
# JDK 11 for legacy JVM work (Flink 1.18 etc.)
cask "temurin@11"
